{
  "products": [
    {
      "id": 1001,
      "name": "Apple MacBook Pro 16-inch",
      "type": "laptop",
      "brand": "Apple",
      "image": "assets/images/Macbook.png",
      "price": 2399.0,
      "description": "Powerful and portable, the Apple MacBook Pro 16-inch features a stunning Retina display, fast processors, ample storage, and all-day battery life. It's designed for professionals and creatives who demand top-notch performance for their work."
    },
    {
      "id": 1002,
      "name": "Dell XPS 13",
      "type": "laptop",
      "brand": "Dell",
      "image": "assets/images/DellXps.png",
      "price": 1399.99,
      "description": "The Dell XPS 13 is a compact and lightweight laptop that offers impressive performance and a virtually borderless InfinityEdge display. It's perfect for users who prioritize both power and portability."
    },
    {
      "id": 1003,
      "name": "HP Spectre x360",
      "type": "laptop",
      "brand": "HP",
      "image": "assets/images/HpSpectre.png",
      "price": 1299.99,
      "description": "The HP Spectre x360 is a versatile 2-in-1 laptop with a sleek design and powerful performance. It features a convertible design, touch screen display, and long battery life, making it ideal for productivity and entertainment on the go."
    },
    {
      "id": 2001,
      "name": "Canon EOS R6",
      "type": "camera",
      "brand": "Canon",
      "image": "assets/images/EOSR6.png",
      "price": 2499.0,
      "description": "The Canon EOS R6 is a high-performance mirrorless camera that delivers exceptional image quality and advanced autofocus capabilities. It's designed for professional photographers and videographers who demand reliability and versatility."
    },
    {
      "id": 2002,
      "name": "Sony Alpha a7 III",
      "type": "camera",
      "brand": "Sony",
      "image": "assets/images/Alphaa7.png",
      "price": 1999.99,
      "description": "The Sony Alpha a7 III is a full-frame mirrorless camera that combines impressive image quality, fast autofocus, and high-speed continuous shooting. It's suitable for both professionals and enthusiasts looking for a versatile camera."
    },
    {
      "id": 2003,
      "name": "Panasonic Lumix GH5 ",
      "type": "camera",
      "brand": "Panasonic",
      "image": "assets/images/LumixGH5.png",
      "price": 1997.99,
      "description": "The Panasonic Lumix GH5 is a feature-packed mirrorless camera designed for videographers. It offers advanced video capabilities, including 4K recording, high frame rates, and professional-level controls."
    },

    {
      "id": 3001,
      "name": "Nikon AF-S FX NIKKOR 24-70mm",
      "type": "lens",
      "brand": "Nikon",
      "image": "assets/images/NIKKOR24-70mm.png",
      "price": 2399.0,
      "description": "The Nikon AF-S FX NIKKOR 24-70mm f/2.8E ED VR Lens is a versatile zoom lens suitable for various photography genres. It offers a wide focal length range, fast aperture, and image stabilization, making it a go-to lens for many professionals."
    },
    {
      "id": 3002,
      "name": "Fujifilm XF 56mm  ",
      "type": "lens",
      "brand": "Fujifilm",
      "image": "assets/images/XF56mm.png",
      "price": 999.0,
      "description": "The Fujifilm XF 56mm f/1.2 R Lens is a prime lens known for its exceptional image quality and beautiful bokeh. It's a popular choice for portrait photographers who want to capture stunning portraits with a shallow depth of field."
    },
    {
      "id": 3003,
      "name": "Sigma 35mm",
      "type": "lens",
      "brand": "Sigma",
      "image": "assets/images/Sigma35mm.png",
      "price": 899.0,
      "description": "The Sigma 35mm f/1.4 DG HSM Art Lens for Canon EF is a high-quality prime lens renowned for its sharpness and low-light performance. It's suitable for a wide range of photography genres, including landscape, street, and portrait photography."
    }
  ],



"items":  [
  {
"id": 1,
"attributes": {
"description": "At the intersection of time-honored acoustic guitar craft and relentless innovation, Highway Series™ instruments transport players to a new era of performance in a way that only Fender® can. Merging a thin, ergonomic form factor and a groundbreaking Fishman® Fluence® Acoustic Pickup system designed around a revolutionary bracing structure, Highway Series guitars exhibit the tactile charm and unplugged resonance of acoustics twice their size, adding unmatched on-lap comfort for a truly unique acoustic experience.",
"price": 999.99,
"category": "acoustic",
"createdAt": "2023-10-27T01:21:01.365Z",
"updatedAt": "2023-10-27T01:21:07.808Z",
"publishedAt": "2023-10-27T01:21:07.806Z",
"model": "Highway Series™ Parlor",
"company": "Fender"
}
},
{
"id": 4,
"attributes": {
"description": "The Fender® American Vintage II series presents a remarkably accurate take on the revolutionary designs that altered the course of musical history. Built with period-accurate bodies, necks and hardware, premium finishes and meticulously voiced, year-specific pickups, each instrument captures the essence of authentic Fender craftsmanship and tone.",
"price": 2199.99,
"category": "electric",
"createdAt": "2023-10-27T01:25:49.399Z",
"updatedAt": "2023-10-27T01:25:51.640Z",
"publishedAt": "2023-10-27T01:25:51.638Z",
"model": "AMERICAN VINTAGE II 1963 TELECASTER®",
"company": "Fender"
}
},
{
"id": 5,
"attributes": {
"description": "American Ultra is our most advanced series of guitars and basses for discerning players who demand the ultimate in precision, performance and tone. The American Ultra Jazz Bass V features a unique \"Modern D\" neck profile for hours of playing comfort, and the tapered neck heel allows easy access to the highest register.",
"price": 2349.99,
"category": "bass",
"createdAt": "2023-10-27T01:27:30.801Z",
"updatedAt": "2023-10-27T01:27:31.981Z",
"publishedAt": "2023-10-27T01:27:31.980Z",
"model": "AMERICAN ULTRA JAZZ BASS® V",
"company": "Fender"
}
},
{
"id": 6,
"attributes": {
"description": "Revive the timeless sound of the '50s with the Vintera® II '50s Precision Bass® and experience the iconic looks, inspiring feel and incomparable tone that only a Fender can deliver.",
"price": 1149.99,
"category": "bass",
"createdAt": "2023-10-27T01:28:47.457Z",
"updatedAt": "2023-10-27T01:28:48.019Z",
"publishedAt": "2023-10-27T01:28:48.017Z",
"model": "VINTERA® II '50S PRECISION BASS®",
"company": "Fender"
}
},
{
"id": 7,
"attributes": {
"description": "Reverb is an essential element in nearly any rig. Whether you're adding dimension to your sound or drenching your signal in sparkling reflections, our Marine Layer Reverb can do it all. Multiple reverb types, including classics like Hall and Room along with modern marvels like Shimmer, make this an indispensable pedal in your signal chain.",
"price": 179.99,
"category": "ampFX",
"createdAt": "2023-10-27T01:30:18.236Z",
"updatedAt": "2023-10-27T01:30:19.684Z",
"publishedAt": "2023-10-27T01:30:19.682Z",
"model": "MARINE LAYER REVERB",
"company": "Fender"
}
},
{
"id": 9,
"attributes": {
"description": "The most versatile pick EVER! Elevate your playing experience with the Fender Offset Pick - the game-changing pick you never knew you needed. Crafted from a durable polycarbonate material, the unique offset shape allows you to maximize your grip for a precise, bright attack. The pick's interior features a contoured thumb imprint and debossed Fender logo for a comfortable, multi-directional grip.",
"price": 8.99,
"category": "accessories",
"createdAt": "2023-10-27T01:35:42.040Z",
"updatedAt": "2023-10-29T23:09:36.691Z",
"publishedAt": "2023-10-27T01:35:42.588Z",
"model": "OFFSET PICKS",
"company": "Fender"
}
},
{
"id": 10,
"attributes": {
"description": "Engineered for players who need a compact, reliable and accurate tuning system, the Fender Original Tuner delivers on all of these criteria - plus a shot of signature style. The powerful vibration-based tuning engine ensures dependable precision, while the bright LCD screen with 360° angle-adjustable swivel is easy-to-read in any performance environment. Featuring Fender color-matched-to-guitar colors, this tuner is a sure-fire Fender lover's favorite.",
"price": 29.99,
"category": "accessories",
"createdAt": "2023-10-27T01:36:38.496Z",
"updatedAt": "2023-10-29T23:09:48.613Z",
"publishedAt": "2023-10-27T01:36:40.128Z",
"model": "ORIGINAL TUNERS",
"company": "Fender"
}
},
{
"id": 11,
"attributes": {
"description": "When you listen to a Gibson round-shoulder acoustic, you will notice that it responds exactly to the player's style and technique - powerful one moment, soft and mellow the next. This 60s J-45 Original offers a period-correct 1 11/16’’ nut width, allowing for comfortable fingering in any position along the mahogany neck. The easily-adjustable saddle can be fine-tuned to players' unique string action preference. ",
"price": 2799,
"category": "acoustic",
"createdAt": "2023-10-30T14:45:30.555Z",
"updatedAt": "2023-10-30T14:49:32.905Z",
"publishedAt": "2023-10-30T14:49:32.904Z",
"model": "60s J-45 Original",
"company": "Gibson"
}
},
{
"id": 12,
"attributes": {
"description": "Hand-crafted in Gibson's acoustic facility in Bozeman, Montana, Eric Church's groundbreaking new acoustic, Hummingbird Dark, is a result of Church's personal artistic vision. With its translucent Ebony Burst lacquer finish, dark mother of pearl fingerboard inlay, black body binding, and a matching new Hummingbird Dark pickguard, this Limited Edition acoustic makes a powerful statement. ",
"price": 3299,
"category": "acoustic",
"createdAt": "2023-10-30T14:50:56.126Z",
"updatedAt": "2023-10-30T14:50:56.995Z",
"publishedAt": "2023-10-30T14:50:56.993Z",
"model": "Eric Church Hummingbird Dark",
"company": "Gibson"
}
},
{
"id": 13,
"attributes": {
"description": "Through a rigorous R&D process spanning several years, Ibanez has reimagined the Dreadnought from the ground up, pursuing the height of rich sound, robust low end, and rich tone. This brand new body shape is called the Grand Dreadnought.",
"price": 464,
"category": "acoustic",
"createdAt": "2023-10-30T15:19:16.722Z",
"updatedAt": "2023-10-30T15:20:00.125Z",
"publishedAt": "2023-10-30T15:19:17.703Z",
"model": "AAD190CE",
"company": "Ibanez"
}
},
{
"id": 14,
"attributes": {
"description": "The small and simple preamp has only two control knobs, volume and shape. This at-a-glance tone control offers natural acoustic sound in the center position. It allows players to adjust the tone easily and enables them to go from low, fat and powerful tones to a bright and crisp sound while adjusting only one knob. A new easy-to-read onboard tuner with LCD(liquid crystal display) is located on the preamp.",
"price": 251,
"category": "acoustic",
"createdAt": "2023-10-30T15:24:24.415Z",
"updatedAt": "2023-10-30T15:24:25.904Z",
"publishedAt": "2023-10-30T15:24:25.902Z",
"model": "AEG50N",
"company": "Ibanez"
}
},
{
"id": 15,
"attributes": {
"description": "The FA-125 is a visually stunning guitar with a budget-friendly price. Quality laminate construction with a modern Fender 3 3 headstock and Viking bridge create an easy-playing instrument that sounds great. Beginners and developing players will appreciate this guitar, which features a nato neck that gives the guitar lively tone and a smooth playing feel.",
"price": 149.99,
"category": "acoustic",
"createdAt": "2023-10-30T15:49:32.552Z",
"updatedAt": "2023-10-30T15:51:37.232Z",
"publishedAt": "2023-10-30T15:49:33.809Z",
"model": "FA-125 DREADNOUGHT",
"company": "Fender"
}
},
{
"id": 16,
"attributes": {
"description": "Explore your individual creativity with the bold looks and inspiring sound of the Newporter Classic. Featuring a solid spruce top and solid mahogany back and sides, the mid-sized Newporter body shape provides a balanced voice that's both articulate and powerful.",
"price": 779,
"category": "acoustic",
"createdAt": "2023-10-30T15:50:43.024Z",
"updatedAt": "2023-10-30T15:50:44.142Z",
"publishedAt": "2023-10-30T15:50:44.140Z",
"model": "NEWPORTER CLASSIC",
"company": "Fender"
}
},
{
"id": 17,
"attributes": {
"description": "Unlock your full potential as a player with the innovative Jackson® Pro Plus Soloist™ SLA3, the final word in high-tech guitar design. A high-performance evolution of the electric guitar, this ergonomic instrument opens up new horizons of playability, resetting the bar of what's possible in guitar design.",
"price": 1546,
"category": "electric",
"createdAt": "2023-10-31T04:27:00.387Z",
"updatedAt": "2023-10-31T04:28:26.157Z",
"publishedAt": "2023-10-31T04:28:26.155Z",
"model": "PRO PLUS SERIES SOLOIST™ SLA3",
"company": "Jackson"
}
},
{
"id": 18,
"attributes": {
"description": "Swift, deadly and affordable, Jackson JS Series guitars take an epic leap forward, making it easier than ever to get classic Jackson tone, looks and playability without breaking the bank.",
"price": 1864,
"category": "electric",
"createdAt": "2023-10-31T04:31:26.559Z",
"updatedAt": "2023-10-31T04:31:27.200Z",
"publishedAt": "2023-10-31T04:31:27.199Z",
"model": "JS SERIES KELLY™ JS32",
"company": "Jackson"
}
},
{
"id": 19,
"attributes": {
"description": "The Jackson® name has always been synonymous with state-of-the-art guitar technology, and the company continues to lead the way in crafting instruments that exceed the demands of today's most discerning players. Melding classic style with modern materials and construction, the Jackson X Series Soloist™ SL3X DX is yet another bold step in the world of high-tech guitars.",
"price": 2658,
"category": "electric",
"createdAt": "2023-10-31T04:34:25.704Z",
"updatedAt": "2023-10-31T04:34:27.668Z",
"publishedAt": "2023-10-31T04:34:27.667Z",
"model": "X SERIES SOLOIST™ SL3X DX",
"company": "Jackson"
}
},
{
"id": 20,
"attributes": {
"description": "With premium features catering to highly-technical playing, multi-dimensional tone and ergonomic design, the brand-new Jackson Pro Plus Dinky® MDK HT7 model provides the ultimate high-performance experience for today's modern players.",
"price": 3154,
"category": "electric",
"createdAt": "2023-10-31T04:38:00.168Z",
"updatedAt": "2023-10-31T04:38:00.732Z",
"publishedAt": "2023-10-31T04:38:00.730Z",
"model": "PRO PLUS SERIES DINKY® MDK HT7",
"company": "Jackson"
}
},
{
"id": 21,
"attributes": {
"description": "The SG Bass has the legendary looks, sound and feel which made it one of Gibson's most iconic basses. The short scale length is actually a big part of this sound! While the short scale length of the SG Bass is preferred by smaller players, it's also preferred by many for the strong fundamental tone for which this short scale bass is known.",
"price": 1999,
"category": "bass",
"createdAt": "2023-10-31T05:03:21.546Z",
"updatedAt": "2023-10-31T05:03:22.163Z",
"publishedAt": "2023-10-31T05:03:22.161Z",
"model": " SG Standard Bass",
"company": "Gibson"
}
},
{
"id": 22,
"attributes": {
"description": "Ever since it was first released back in 1965, the Non-Reverse Thunderbird has been THE choice for forward-looking bassists who want to make their own path and steadfastly refuse to follow the crowd. The Non-Reverse Thunderbird's distinctive styling and huge, thunderous tone make it a standout on stage and in the studio.",
"price": 2399,
"category": "bass",
"createdAt": "2023-10-31T05:05:41.628Z",
"updatedAt": "2023-10-31T05:05:42.239Z",
"publishedAt": "2023-10-31T05:05:42.238Z",
"model": "Non-Reverse Thunderbird",
"company": "Gibson"
}
},
{
"id": 23,
"attributes": {
"description": "The Les Paul Junior Tribute DC Bass is a tribute to the historic Gibson EB-0 bass from the late 50's, but with modern features. Not just for smaller players, the short scale length is actually chosen by many for its strong fundamental tone and sits perfectly in a track when recording. ",
"price": 999,
"category": "bass",
"createdAt": "2023-10-31T05:08:59.776Z",
"updatedAt": "2023-10-31T05:09:01.812Z",
"publishedAt": "2023-10-31T05:09:01.810Z",
"model": "Les Paul Junior Tribute DC Bass",
"company": "Gibson"
}
},
{
"id": 24,
"attributes": {
"description": "Gene Simmons is a legendary rock icon and the bassist from KISS, and his new Gibson Gene Simmons G2 Thunderbird Bass reflects his tastes. Designed to meet the musical needs of modern bassists, it features the classic Reverse Thunderbird™ body and headstock shape. ",
"price": 2799,
"category": "bass",
"createdAt": "2023-10-31T05:12:15.667Z",
"updatedAt": "2023-10-31T05:12:16.384Z",
"publishedAt": "2023-10-31T05:12:16.383Z",
"model": "Gene Simmons G2 Thunderbird",
"company": "Gibson"
}
},
{
"id": 25,
"attributes": {
"description": "The new MARK FIVE: 35™, in both traditional compact Boogie® 1x12 Combo and 19” Head formats, provides a “greatest hits” collection of our renowned Mark Series circuits from 3 Decades. ",
"price": 2799,
"category": "ampFX",
"createdAt": "2023-10-31T05:54:14.975Z",
"updatedAt": "2023-10-31T05:54:15.581Z",
"publishedAt": "2023-10-31T05:54:15.580Z",
"model": "Mark Five: 35 1x12 Combo",
"company": "MesaBoogie"
}
},
{
"id": 27,
"attributes": {
"description": "You already know MESA® Pedals are built by the very same artisans that create the Award-Winning Mark Five™, the legendary Dual and Triple Rectifier® and the soulful new vintage-voiced offerings, Fillmore and California Tweed. Now here are three exciting new hand-built overdrive pedals spanning the entire range of gain and stylistic spectrum. ",
"price": 209,
"category": "ampFX",
"createdAt": "2023-10-31T06:03:39.849Z",
"updatedAt": "2023-10-31T06:03:41.094Z",
"publishedAt": "2023-10-31T06:03:41.093Z",
"model": "Gold Mine",
"company": "MesaBoogie"
}
}
]
  
}
